tutorials/incompressible/icoDyMFoam/movingConeMotion/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoDMotion      yes;

dynamicFvMesh   dynamicMotionSolverFvMesh;

solver          laplaceFaceDecomposition;

diffusivity     file;
// diffusivity     uniform;

frozenDiffusion off;

distancePatches
(
    movingWall
    farFieldMoving
);

// ************************************************************************* //
